# SAMPLING ON `adultKNN` DATA

###### - Importing Pandas Library

In [1]:
import pandas as pd

###### - Reading csv File

In [2]:
ak = pd.read_csv("adultKNN.csv")
ak.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

- > As there are Null values present in form of " ? "

### Replacing " ? " to Null Values

###### - Importing Numpy Library

In [3]:
import numpy as np

###### - Replacing " ? " to np.nan

In [4]:
ak.replace({"?": np.nan}, inplace = True)

### Handeling Of Null Values

###### - Checking For Null values in dataset

In [5]:
ak.isnull().sum()[ak.isnull().sum() > 0]

workclass         2799
occupation        2809
native-country     857
dtype: int64

###### - Fill of Null values

In [6]:
ak['occupation'].value_counts()

Prof-specialty       6172
Craft-repair         6112
Exec-managerial      6086
Adm-clerical         5611
Sales                5504
Other-service        4923
Machine-op-inspct    3022
Transport-moving     2355
Handlers-cleaners    2072
Farming-fishing      1490
Tech-support         1446
Protective-serv       983
Priv-house-serv       242
Armed-Forces           15
Name: occupation, dtype: int64

In [7]:
ak.workclass.fillna("Private", inplace = True)
ak.occupation.fillna("others", inplace = True)

In [8]:
ak= ak.dropna()

###### - Checking for Null values after filling of Null values

In [9]:
ak.isnull().sum()[ak.isnull().sum() > 0]

Series([], dtype: int64)

- > As There are no any Null value remaining in dataset

### Changing Non-Numeric Values To Numeric Values

###### - Changing non-numeric data to numeric of ordinal data by using `replace function`6 manually

In [10]:
# Here the 'Education' column contains an Ordinal data 

ak.replace({"education" : {"Preschool":1,"1st-4th":2,"5th-6th":3,"7th-8th":4,
                           "9th":5,"10th":6,"11th":7,"12th":8,"HS-grad":9,
                           "Some-college":10,"Assoc-voc":12,"Assoc-acdm":13,
                           "Bachelors":14,"Masters":15,"Prof-school":16,"Doctorate":17}}, inplace = True)

In [11]:
ak.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,7,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,9,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,13,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,10,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,Private,103497,10,10,Never-married,others,Own-child,White,Female,0,0,30,United-States,<=50K

###### - Changing non-numeric data to numeric by using  `LabelEncoder`

###### - Importing `LabelEncoder` from `sklearn.preprocessing`

In [12]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()  # object created for label encoder

In [13]:
# Converting the non-numeric data to numeric

ak[ak.select_dtypes(include ='object').columns] = ak[ak.select_dtypes(include ='object').columns].apply(le.fit_transform)

In [14]:
ak

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,3,226802,7,7,4,6,3,2,1,0,0,40,38,0
1,38,3,89814,9,9,2,4,0,4,1,0,0,50,38,0
2,28,1,336951,13,12,2,10,0,4,1,0,0,40,38,1
3,44,3,160323,10,10,2,6,0,2,1,7688,0,40,38,1
4,18,3,103497,10,10,4,14,3,4,0,0,0,30,38,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48837,27,3,257302,13,12,2,12,5,4,0,0,0,38,38,0
48838,40,3,154374,9,9,2,6,0,4,1,0,0,40,38,1
48839,58,3,151910,9,9,6,0,4,4,0,0,0,40,38,0
48840,22,3,201490,9,9,4,0,3,4,1,0,0,20,38,0
48841,52,4,287927,9,9,2,3,5,4,0,15024,0,40,38,1

### Sampling

###### - Importing `train_test_split` from `sklearn.model_selection`

In [15]:
from sklearn.model_selection import train_test_split

###### - Dividing the data into  train and test data

In [16]:
train_ak , test_ak = train_test_split(ak,test_size=0.2)

train_ak_x = train_ak.iloc[:,0:-1]
train_ak_y = train_ak.iloc[:,-1]

test_ak_x = test_ak.iloc[:,0:-1]
test_ak_y = test_ak.iloc[:,-1]